Revit 2024 API
ConduitSizeSettings.GetConduitSizeSettingsIterator Method
 Returns a ConduitSizeSettingIterator to the conduit size settings.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public ConduitSizeSettingIterator GetConduitSizeSettingsIterator()
Visual Basic
Public Function GetConduitSizeSettingsIterator As ConduitSizeSettingIterator
Visual C++
public:
ConduitSizeSettingIterator^ GetConduitSizeSettingsIterator()
See Also
ConduitSizeSettings Class
Autodesk.Revit.DB.Electrical Namespace